Revit 2023 API
ColorOptions.AlertColor Property
 The color used to highlight elements when a special alert is required.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2020.1
Syntax
C#
public Color AlertColor { get; set; }
Visual Basic
Public Property AlertColor As Color
	Get
	Set
Visual C++
public:
property Color^ AlertColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ColorOptions Class
Autodesk.Revit.DB Namespace